[{"LANGUAGE":"spa","TITLE":"Inadecuada configuración de encabezados de seguridad","OBSERVATION":{"TITLE":"Se ha observado que la aplicación presenta debilidades en la configuración de encabezados de seguridad. En particular los siguientes encabezados se han identificado como faltantes o incorrectamente configurados:<X-XSS-Protection,CSP,X-Content-Type-Options,HTTP Strict-Transport-Security,X-Frame-Options>\nEl encabezado X-XSS-Protection previene al navegador del usuario de la ejecución del contenido JavaScript inyectado que se vea reflejado en las respuestas de la aplicación.\nEl encabezado Content-Security-Policy previene al navegador de cargar recursos provenientes de otros sitios, como ser JavaScript.\nEl encabezado HTTP Strict-Transport-Security se utiliza para informar a los navegadores que las aplicaciones web sólo se deben acceder a través de HTTPS, lo que impide el uso de canales sin cifrar.\nEl encabezado X-Frame-Options se utiliza para prevenir ataques conocidos como clickjacking donde la aplicación web afectada es cargada a través de objetos del tipo frame / iframe sobre un sitio malicioso.\nAdemás, si el encabezado X-Content-Type-Options no está presente, la aplicación no podrá prevenir que el navegador trate de inferir el tipo de contenido de la respuesta a partir del análisis de dicho contenido. Esto permitiría a un individuo malicioso que tuviera la posibilidad de subir contenido al servidor, a subir un archivo malicioso (por ejemplo, con código JavaScript) utilizando una extensión considerada inofensiva (.jpg). Al no estar configurado el encabezado de seguridad en cuestión, un usuario podría acceder al archivo malicioso, sin advertir que el navegador podría inferir el tipo de contenido como “text/javascript” y ejecutar el código malicioso.","NOTE":"La falta o configuración incorrecta de estos encabezados no representa la existencia efectiva de la vulnerabilidad asociada sobre cada uno, o una posibilidad concreta de explotación."},"IMPLICATION":"La falta de una protección anti-clickjacking podría forzar al navegador del usuario a cargar un sitio web incluido dentro de las etiquetas <frame> o <iframe>. Esto podría proveerle a un individuo malicioso la capacidad de aplicar técnicas de ingeniería social contra usuarios legítimos de la aplicación, induciéndolos a realizar un \"click\" sobre el contenido malicioso, con el fin de intentar obtener sus credenciales u otra información de sesión que le permita obtener acceso no autorizado a la aplicación.\nSi una aplicación web no impide su acceso a través de un canal no cifrado (HTTP), entonces un usuario válido puede ser víctima de un tipo de ataque de tipo hombre en el medio como los basados en SSL Stripping o usando un certificado SSL no válido. Que puede ser utilizado por una persona malintencionada para obtener acceso no autorizado a datos confidenciales o para acceder a la aplicación haciéndose pasar por la víctima.\nLa falta de encabezados CSP y X-XSS-Protection, le podría permitir a un usuario malicioso abusar de otras vulnerabilidades, como XSS, para cargar recursos adicionales como scripts o exploits en los navegadores de las víctimas para aumentar los vectores de ataque que tienen a su disposición.","RECOMMENDATION":{"TITLE":"Se recomienda realizar la respectiva configuración de los encabezados mencionados previamente, de forma correcta, para prevenir eventuales ataques por ausencia de los mismos.","URLS":["https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-XSS-Protection","https://www.owasp.org/index.php/Content_Security_Policy","https://docs.microsoft.com/en-us/previous-versions/windows/internet-explorer/ie-developer/compatibility/gg622941(v=vs.85)?redirectedfrom=MSDN"]},"SEVERITY":"BAJO"}
,{"LANGUAGE":"spa","TITLE":"Se encontro firebase abierta","OBSERVATION":{"TITLE":"<TO DEFINE>","NOTE":""},"IMPLICATION":"<TO DEFINE>","RECOMMENDATION":{"TITLE":"<TO DEFINE>","URLS":[]},"SEVERITY":"<TO DEFINE>"}
,{"LANGUAGE":"eng","TITLE":"Possible css injection found","OBSERVATION":{"TITLE":"<TO DEFINE>","NOTE":""},"IMPLICATION":"<TO DEFINE>","RECOMMENDATION":{"TITLE":"<TO DEFINE>","URLS":[]},"SEVERITY":"<TO DEFINE>"}
,{"LANGUAGE":"eng","TITLE":"Outdated 3rd party libraries in use","OBSERVATION":{"TITLE":"Outdated and potentially vulnerable jQuery libraries are hosted on the affected resources. There is an exploit related to the identified jQuery JavaScript libraries' versions that could potentially result in a Cross-site scripting attack (XSS) against the application.","NOTE":"The observation was made based on the information disclosed on the affected URLs' source code. It may be possible for an up-to-date product to be incorrectly reflected on the source code as outdated. In those scenarios, the observation should be disregarded."},"IMPLICATION":"It may be more feasible for a malicious individual to compromise outdated libraries. The vulnerability for the outdated jQuery libraries is rated as medium risk and the related exploit may be publicly available on the Internet. This exploit could be used to generate Cross-site scripting attacks.","RECOMMENDATION":{"TITLE":"Tactical recommendation:\nManagement should consider upgrading the identified libraries to the latest recommended version.\nStrategic recommendation:\nManagement should consider regularly monitoring for the release of updates for all applications in use within the environment, and ensure their installation in a timely fashion.","URLS":["https://capec.mitre.org/data/definitions/310.html"]},"SEVERITY":"<TO DEFINE>"}
,{"LANGUAGE":"spa","TITLE":"Métodos HTTP extendidos habilitados","OBSERVATION":{"TITLE":"Se ha observado, en los servicios afectados, la existencia de métodos HTTP adicionales habilitados tales como: <PUT, DELETE, CONNECT, PATCH, PROPFIND, PROPPATCH, MKCOL, COPY, MOVE, LOCK, UNLOCK, TRACE>\n<SI DEBUG AGREGAR> El método adicional HTTP DEBUG.\n<SI TRACE AGREGAR> El método TRACE podría permitirle a individuos maliciosos ejecutar ataques del tipo Cross-site Tracing.\n<SI PROPFIND y VERSION de IIS = 5.x o 6.x AGREGAR> El método PROPFIND podría permitirle a un individuo malicioso ganar acceso no autorizado a recursos protegidos.\n<SI PROPFIND y VERSION de IIS = 7.x AGREGAR> El método PROPFIND podría permitirle a un individuo malicioso comprometer información confidencial almacenada en archivos del servidor web.","NOTE":""},"IMPLICATION":"Un individuo malicioso podría utilizar los métodos HTTP extendidos identificados para obtener información sensible sobre el entorno y/o ejecutar acciones no autorizadas. Cabe destacar que incluso si los recursos no exponen información sensible actualmente, una fuga de información podría ocurrir en el futuro cercano.\n<SI TRACE AGREGAR> Aunque los datos enviados mediante una solicitud HTTP TRACE sean reflejados por el servidor, para que el ataque de Cross-site Tracing (XST) sea exitoso es necesario que se utilice en conjunto con una vulnerabilidad de Cross-site Scripting. Esto podría permitir que información sensible, como cookies de sesión <y/o cabeceras de autenticación HTTP BASIC>, sea transferida a un sitio malicioso, para luego ser usadas en ataques de robo de sesión.\n<SI DELETE AGREGAR> El método DELETE podría permitirle a un individuo malicioso eliminar archivos del servidor web.\n<SI PROPFIND y IIS VERSION 5.x / 6.x AGREGAR> El método PROPFIND podría permitir la elevación de privilegios, lo que podría conducir a un individuo malicioso a eludir el mecanismo de autenticación para acceder al contenido del servidor IIS.\n<SI PROPFIND y IIS VERSION 7.x AGREGAR> El método PROPFIND podría permitirle a un individuo malicioso comprometer información confidencial almacenada en archivos del servidor.\n<SI DEBUG> El método DEBUG podría permitirle a un individuo malicioso generar ataques de denegación de servicio en el servidor afectado. A pesar de que su ejecución se encuentra actualmente denegada en el path identificado, podría inadvertidamente ser permitida en el futuro.","RECOMMENDATION":{"TITLE":"Se recomienda analizar si los métodos HTTP extendidos identificados son requeridos por el negocio, y deshabilitarlos en caso de no ser requeridos. De igual manera, se recomienda revisar los estándares de configuración de los servidores para asegurar que los métodos HTTP innecesarios se encuentren deshabilitados antes de promover un servidor a producción.","URLS":["<SI IIS>Para más información, por favor, visite el siguiente enlace: http://technet.microsoft.com/en-us/library/dd450371.aspx (enlace con contenido en Inglés)","<SI APACHE>Para más información, por favor, visite el siguiente enlace: http://httpd.apache.org/docs/2.0/en/mod/core.html#traceenable <si no es 2.0, cambiar>","<SI TRACE>Además, visite el siguiente enlace: http://capec.mitre.org/data/definitions/107.html"]},"SEVERITY":"BAJO"}
,{"LANGUAGE":"eng","TITLE":"Misconfiguration in Bucket found","OBSERVATION":{"TITLE":"<TO DEFINE>","NOTE":""},"IMPLICATION":"<TO DEFINE>","RECOMMENDATION":{"TITLE":"<TO DEFINE>","URLS":[]},"SEVERITY":"<TO DEFINE>"}
,{"LANGUAGE":"spa","TITLE":"Se encontraron endpoints vulnerables","OBSERVATION":{"TITLE":"<TO DEFINE>","NOTE":""},"IMPLICATION":"<TO DEFINE>","RECOMMENDATION":{"TITLE":"<TO DEFINE>","URLS":[]},"SEVERITY":"<TO DEFINE>"}
,{"LANGUAGE":"eng","TITLE":"Unnecessary services exposed to the Internet","OBSERVATION":{"TITLE":"The identified devices have the SNMP / RDP “rsh”, “rlogin” and “rexec” services enabled and exposed to the Internet.","NOTE":""},"IMPLICATION":"A malicious individual may be able to use these services to obtain sensitive information about the devices. Even if the services are not currently disclosing sensitive information, information leakage may inadvertently occur in the future. Unnecessary services that are exposed because of a business requirement expose the organization to needless risk because of potentially existing 0 day attacks against them.","RECOMMENDATION":{"TITLE":"Management should consider disabling these if not required for business purposes. If they are a part of a business process consider the possibility of restricting their access through the use of a firewall.","URLS":[""]},"SEVERITY":"LOW"}
,{"LANGUAGE":"spa","TITLE":"Servicios innecesarios disponibles en internet","OBSERVATION":{"TITLE":"Se ha identificado que el recurso afectado presenta servicios innecesarios accesibles desde internet, lo cual facilita posibles ataques que podrían comprometer la disponibilidad, confidencialidad e integridad del sistema. El banner detectado en dicho servicio es \"Microsoft Windows RPC\".","NOTE":""},"IMPLICATION":"La utilización de servicios innecesarios eleva el riesgo de que un usuario malintencionado pudiese comprometer dicho equipo mediante la explotación de vulnerabilidades conocidas sobre los mismos. Un usuario malintencionado podría aprovechar las vulnerabilidades que pudieran existir para el servicio innecesario identificado mediante la utilización de exploits.","RECOMMENDATION":{"TITLE":"Se recomienda analizar la posibilidad la posibilidad de detener y deshabilitar, o bien no publicar en internet, aquellos servicios innecesarios en el servidor a fin de mitigar posibles riesgos.","URLS":[""]},"SEVERITY":"MEDIO"}
,{"LANGUAGE":"spa","TITLE":"Acceso administrativo mediante usuarios por defecto","OBSERVATION":{"TITLE":"Se pudo identificar que existe un servidor que brinda acceso a una página de administración, la cual cuenta con usuario y contraseña de administración configurado por defecto.","NOTE":""},"IMPLICATION":"Es posible que un usuario malintencionado acceda a las paginas de administración utilizando usuarios por defecto que son de conocimiento publico. En caso de que un usuario malintencionado logre validarse en dicho recurso, es posible que realice operaciones administrativas que pueden comprometer el recurso afectado.","RECOMMENDATION":{"TITLE":"Se recomienda analizar la posibilidad la posibilidad de eliminar los usuarios por defecto a fin de evitar posibles inconvenientes a futuro en caso de surgir una nueva vulnerabilidad o en su defecto se deberá analizar la posibilidad de modificar las contraseñas por defecto de los usuarios con privilegios de administración.","URLS":[]},"SEVERITY":"MEDIO"}
,{"LANGUAGE":"eng","TITLE":"Firebase found open","OBSERVATION":{"TITLE":"<TO DEFINE>","NOTE":""},"IMPLICATION":"<TO DEFINE>","RECOMMENDATION":{"TITLE":"<TO DEFINE>","URLS":[]},"SEVERITY":"<TO DEFINE>"}
,{"LANGUAGE":"eng","TITLE":"CORS vulnerability found","OBSERVATION":{"TITLE":"<TO DEFINE>","NOTE":""},"IMPLICATION":"<TO DEFINE>","RECOMMENDATION":{"TITLE":"<TO DEFINE>","URLS":[]},"SEVERITY":"<TO DEFINE>"}
,{"LANGUAGE":"spa","TITLE":"Ataque de cabecera Host posible","OBSERVATION":{"TITLE":"Se ha observado que el sitio web afectado es vulnerable al ataque de cabecera Host. Este ataque representa una debilidad dentro de una aplicación, y ocurre debido a una inadecuada validación de parámetros de la información contenida en la cabecera Host, en la entrada y la salida, la cual es empleada para <EJEMPLO: generar un enlace de reestablecimiento de contraseña que es enviado al usuario vía correo electrónico). Al usar la <nombre de la opción> dentro de la <nombre de la función>, es posible inyectar <EJEMPLO: URLs arbitrarias que serán reflejadas como parte del enlace de reestablecimiento de contraseñas>. La función afectada es:\n* Función afectada\n* URL afectada\n* Parámetro afectado: cabecera Host (POST/GET)\n* Payload","NOTE":""},"IMPLICATION":"Una aplicación web que emplea el valor de la cabecera Host para generar dinámicamente generar <EJEMPLO: un enlace de reestablecimiento de contraseña> podría ser vulnerable a ataques, siempre que no se realice una adecuada validación de parámetros para el valor de la cabecera mencionada, para la entrada y la salida. En particular, esto podría permitir a un individuo malicioso <EJEMPLO: inducir a un usuario legítimo de la aplicación a visitar un sitio web controlado por él, mediante el envío de una URL especialmente confeccionada en el cuerpo de un correo electrónico enviado al usuario desde una dirección de correo electrónico perteneciente a <CLIENTE>. Si es exitoso, este ataque podría permitir al individuo malicioso a obtener credenciales de autenticación u otra información confidencial de la víctima, y / o intentar descargar software malicioso en el equipo de la víctima, con el fin de intentar comprometerlo.","RECOMMENDATION":{"TITLE":"Se recomienda analizar la posibilidad de evitar el uso de la cabecera Host para generar contenido dinámicamente en el sitio web (como ser enlaces de redirección). Además, se recomienda analizar la posibilidad de implementar una apropiada validación para todos los parámetros procesados por la aplicación, ya sean de entrada o de salida, en el código que se ejecuta en el servidor. La misma debería determinar el tipo de dato esperado, junto con su longitud y caracteres permitidos, descartando toda desviación. Cabe destacar que dichas validaciones no deberían acotarse a aquellos parámetros y recursos presentados a modo de ejemplo, sino que se recomienda extender dicha implementación a todos los parámetros de la aplicación. Además, se recomienda realizar un análisis detallado a nivel de código fuente, para identificar y verificar la existencia de oportunidades de mejora en el esquema de validación de parámetros de las distintas funcionalidades de la aplicación. Finalmente, como nivel adicional de seguridad, se recomienda considerar la implementación de un firewall de capa de aplicación para bloquear solicitudes HTTP maliciosas.","URLS":["https://www.owasp.org/index.php/Data_Validation"]},"SEVERITY":"MEDIO"}
,{"LANGUAGE":"eng","TITLE":"Insecure HTTP Response Header Configuration (Invalid value)","OBSERVATION":{"TITLE":"During inspection of the HTTP headers returned by the application, the following series of weaknesses and/or missing adherence to best-practice was observed:\nClickjacking can be used to overlay the application with a layer, which can capture data typed into input fields or to invisibly overlay the application on top of an external site to trick an authenticated user into performing actions inside the application while browsing the external site. We noticed that the system does not set the anti-clickjacking header. \nThe server does not restrict the origin domain using the Cross-Origin Resource Sharing (CORS) header, because the header is not properly configured (e.g. using a ‘wildcard’). This means that any origin domain is permitted to access application resources Furthermorethe server has the “Access-Control-Allow-Credentials: true” flag set. This option will cause the cross-site HTTP request to include HTTP cookies and HTTP authentication information.\nModern browsers have support for the HTTP Strict Transport Security (HSTS) header, which forces the use of SSL/TLS for subsequent visits to the website. This allows mitigation of certain Man-in-the-Middle attacks, for example when a user accesses the HTTP version of a website over an untrusted network. We noticed that the system does not set the HTTP Strict Transport Security header.\nModern browsers and proxy servers cache content to reduce latency and network traffic. The cached content could contain sensitive information. The cache control headers prevent caching of sensitive content in the browser and on proxies. This means that the browser should NEVER cache a sensitive page, it should always retrieve a fresh copy of the page. We noticed that the system does not set the Cache-Control and Pragma: no-cache header.\nModern browsers have support for the Content Security Policy (CSP) header, which allows the web server to define policies for browsers on how to deal with potentially dangerous content, such as inline scripts embedded in a web page or scripts from non-whitelisted domains. CSP also covers stylesheets (CSS). The proper use of the CSP helps to mitigate the risk of so-called Cross-site Scripting attacks (XSS). We noticed the system does not set the Content Security Policy header.\nThe X-XSS-Protection response header is a feature of Internet Explorer, Chrome and Safari to prevent some reflected Cross-site Scripting (XSS) attacks. Although, strong Content-Security-Policy headers are used in modern browsers to prevent XSS attacks, the X-XSS-Protection header can still provide protection for users of older web browsers that do not yet support CSP.","NOTE":""},"IMPLICATION":"Without the anti-clickjacking header, it is possible for an attacker to overlay the site with a transparent layer and capture data input or keystrokes from the user. The attacker would need to find a Cross-site Scripting issue or trick the user into visiting the page through a crafted link/website before this can be misused.\nBy missing the CORS header it is possible for an attacker to include components, images, pages from the application into other websites. This could be used by the attacker to craft a site with scripts which retrieves data from the application and submits it to the attacker.\nWhen no HSTS header is present and the site is also available over unencrypted HTTP, attackers can use special tooling to keep victims who access the site over HTTP on an HTTP connection, despite attempts of the application to redirect the user to HTTPS (known as ‘ssl stripping’). An attacker would need to be on a dedicated network to be able to perform such a Man-in-the-Middle attack.\nWithout a CSP and X-XSS-Protection header, it is possible for an attacker to abuse other vulnerabilities, such as XSS, to load additional resources such as scripts or exploits into victims browsers in order to increase the attack vectors they have at their disposal.","RECOMMENDATION":{"TITLE":"It is recommended to improve the HTTP header configuration by:\nImplementing anti-clickjacking measures, such as adding the X-Frame-Options header.\nUsing a “whitelist” approach for permitting origin domains to prevent CORS. Normally only the domain should be allowed.\nEnable the HTTP Strict Transport Security header to enforce usage of SSL/TLS in modern browsers and to improve protection against downgrade attacks and cookie hijacking.\nEnable cache control headers (cache-control: private, max-age0, no-cache) and the pragma header (pragma: no-cache) for older browsers.\nDefine a whitelist in the Content Security Policy header to enforce security policies in modern browsers on potentially malicious use of scripts and stylesheets.","URLS":["<If Clickjacking> https://www.owasp.org/index.php/Clickjacking_Defense_Cheat_Sheet.","<If CORS> https://www.owasp.org/index.php/CORS_OriginHeaderScrutiny","<If HSTS>https://www.owasp.org/index.php/HTTP_Strict_Transport_Security.","<IF CSP>https://www.owasp.org/index.php/Content_Security_Policy.","<If Cache-Control>https://www.owasp.org/index.php/OWASP_Application_Security_FAQ#Browser_Cache."]},"SEVERITY":"HIGH"}
,{"LANGUAGE":"spa","TITLE":"Software desactualizado","OBSERVATION":{"TITLE":"Se ha observado la presencia de servicios que poseen versiones de software desactualizadas. Los servicios observados, junto con las vulnerabilidades identificadas se detallan a continuación: <cuadro con tres columnas \"Software\", \"Versión\" y \"CVEs\">.","NOTE":"<agregar Y ADAPTAR si corresponde> NOTA: Esta observación fue realizada en base a la información obtenida de algunos de los encabezados de los recursos afectados. Es posible que un producto actualizado se refleje incorrectamente en los encabezados como desactualizado. En esos escenarios, esta observación debería ser desestimada. A si mismo, los CVEs listados son sólo una referencia de las vulnerabilidades existentes."},"IMPLICATION":"Un individuo malicioso podría comprometer con mayor facilidad los servicios afectados, ya que las versiones de software asociadas a los mismos poseen vulnerabilidades y/o debilidades de seguridad previamente reportadas. Las vulnerabilidades mencionadas son de conocimiento público y los detalles de las mismas se encuentran disponibles. En consecuencia, un individuo malicioso podría intentar explotarlas para comprometer la confidencialidad, integridad y/o disponibilidad de la información a través de los servidores afectados.","RECOMMENDATION":{"TITLE":"Se recomienda analizar la posibilidad de actualizar los servicios afectados a las versiones recomendadas por los fabricantes o bien aplicar todos los parches de seguridad disponibles.","URLS":[]},"SEVERITY":"ALTO"}
,{"LANGUAGE":"eng","TITLE":"Vulnerable endpoints were found","OBSERVATION":{"TITLE":"<TO DEFINE>","NOTE":""},"IMPLICATION":"<TO DEFINE>","RECOMMENDATION":{"TITLE":"<TO DEFINE>","URLS":[]},"SEVERITY":"<TO DEFINE>"}
,{"LANGUAGE":"eng","TITLE":"Microsoft short name directory and file enumeration","OBSERVATION":{"TITLE":"The application is susceptible to short name enumeration of files and folders. Each time a new file is created on Windows, an MS-DOS short file name that is compatible with the 8.3 format is created for that file. This short name is used to allow MS-DOS based or 16-bit Windows based programs to access files with long names. In particular, it is possible to enumerate short name of files and folders in the affected resource.\nThe affected URL is:\nThe affected Directories are: ","NOTE":""},"IMPLICATION":"A malicious individual may take advantage of this vulnerability in order to attempt to enumerate valid directories and files containing potential sensitive information, and later perform further targetted attacks in order to obtain the complete file name (long name), potentially allowing the malicious individual to gain access the affected files. ","RECOMMENDATION":{"TITLE":"Management should consider evaluating if there is a business requirement for the short name creation to be enabled. If not necessary, management should consider disabling the Windows 8.3 short name creation. In addition, Management should consider evaluating the possibility of discarding web requests containing the tilde character (\"~\") and\nits Unicode equivalences. <IF IIS: Furthermore, management should consider upgrading the IIS software to the latest recommended version.>","URLS":["https://technet.microsoft.com/en-us/library/cc959352.aspx","https://soroush.secproject.com/downloadable/microsoft_iis_tilde_character_vulnerability_feature.pdf"]},"SEVERITY":"MEDIUM/HIGH"}
,{"LANGUAGE":"eng","TITLE":"Host header attack possible","OBSERVATION":{"TITLE":"The identified website is vulnerable to the Host header attack. Host header attack is a weakness within an application, and is due to insufficient validation and output encoding of the Host header data (i.e. input data being sent from the user/presentation layer), which is later being used to <EXAMPLE: generate a password reset link that is sent to the user via email>. When using the \"<function NAME>\" within the \"<OPTION NAME>\" option, it is possible to inject <EXAMPLE: arbitrary URLs that will be reflected as part of the password reset link>. The affected function is:\n* Affected function\n* Affected URL\n* Affected parameter: Host header (POST/GET)\n* Payload","NOTE":""},"IMPLICATION":"A web application that use the Host header value to dinamically generate <EXAMPLE: password reset links> may be vulnerable to several attacks, provided that an appropriate input validation and output encoding is not in place for the aforementioned header's value. In particular, this may allow a malicious individual to <EXAMPLE: trick a legitimate application user to visit a website controlled by her, by embeding a crafted URL into the body of an email sent to the user from a <CLIENT>'s email address>. If successful, this attack may enable the malicious individual to retrieve login credentials or other confidential information from the victim, and/or attempt downloading malware within the victim's computer, in order to compromise it.","RECOMMENDATION":{"TITLE":"Management should consider ensuring that every input parameter received from application users must be sanitized and validated on the server side (client side validations should be considered as an improvement of performance for the web application). In addition, management should consider not using the Host header to generate any content that will be later be presented to application users. Furthermore, management should consider creating a dummy virtual host to capture all requests with unrecognized host headers. As an additional layer of security, consider implementing an application layer firewall to block malicious requests.","URLS":[]},"SEVERITY":"MEDIUM"}
,{"LANGUAGE":"spa","TITLE":"Mala configuración en Bucket","OBSERVATION":{"TITLE":"<TO DEFINE>","NOTE":""},"IMPLICATION":"<TO DEFINE>","RECOMMENDATION":{"TITLE":"<TO DEFINE>","URLS":[]},"SEVERITY":"<TO DEFINE>"}
,{"LANGUAGE":"eng","TITLE":"Web versions vulnerabilities found","OBSERVATION":{"TITLE":"<TO DEFINE>","NOTE":""},"IMPLICATION":"<TO DEFINE>","RECOMMENDATION":{"TITLE":"<TO DEFINE>","URLS":[]},"SEVERITY":"<TO DEFINE>"}
,{"LANGUAGE":"eng","TITLE":"Extended HTTP methods enabled","OBSERVATION":{"TITLE":"The affected resources have additional <WebDAV/HTTP> methods enabled such as:\n<PUT, DELETE, CONNECT, PATCH, PROPFIND, PROPPATCH, MKCOL, COPY, MOVE, LOCK, UNLOCK, TRACE>\n<IF DEBUG ADD THIS> The additional HTTP DEBUG method.\n<IF TRACE ADD THIS> The TRACE method may allow a malicious individual to execute a cross-site tracing attack.\n<IF PROPFIND AND VERSION IIS 5.x / 6.x ADD THIS> The PROPFIND method may allow a malicious individual to gain unauthorized access to protected resources.\n<IF PROPFIND AND VERSION IIS 7.x ADD THIS> The PROPFIND method may allow a malicious individual to compromise confidential information stored in Web server files.","NOTE":""},"IMPLICATION":"A malicious individual may be able to use the identified extended methods in order to obtain sensitive information about the environment, and/or perform unauthorized functions. Even if the servers are not currently disclosing sensitive information, information leakage may inadvertently occur in the future.\n<IF TRACE ADD THIS> Although the HTTP TRACE request data would be reflected back by the server, for the Cross Site Tracing (XST) attack to work, it must be used in combination with a cross-site scripting vulnerability. This may allow for information such as session cookies <and/or BASIC Authentication header> to be transferred to a malicious site, in order to later be used for session hijacking. It should be noted that the attack might work despite the session cookie be protected by the HTTPOnly atribute.\n<IF DEBUG ADD THIS> a malicious individual may be able to use the extended DEBUG HTTP method enabled to obtain sensitive information about the affected resource. Furthermore, denial of service may be possible through the use of this available option.\n<IF DELETE ADD THIS> The enabled \"delete\" method, may allow a malicious user to remove web server files.\n<IF PUT ADD THIS>  a malicious individual may be able to use the extended PUT method to upload and replace or modify web server files.\n<IF DEBUG ADD THIS> Enabling DEBUG method could lead a malicious individual to cause denial of service on the affected host. In spite of the fact that execution access is currently denied on the identified path, it may inadvertently be allowed in the future.\n<IF PROPFIND AND VERSION IIS 5.x / 6.x ADD THIS> The PROPFIND method may allow an elevation of privileges, that may lead the malicious individual to bypass an authentication requirement to access content on an IIS server.\n<IF PROPFIND AND VERSION IIS 7.x ADD THIS> The PROPFIND method may allow a malicious individual to compromise confidential information stored in Web server files.","RECOMMENDATION":{"TITLE":"Management should consider evaluating if these extended methods are required for business purposes and disabling them if unrequired. Furthermore, management should consider reviewing their system configuration standards to ensure that potentially unnecessary web server methods are disabled, and ensuring configurations are consistent within the organization.","URLS":["<IF IIS> http://technet.microsoft.com/en-us/library/dd450371.aspx","<IF APACHE, CHANGE ACCORDING TO VERSION> http://httpd.apache.org/docs/2.0/en/mod/core.html#traceenable","<IF TRACE> http://capec.mitre.org/data/definitions/107.html"]},"SEVERITY":"LOW"}
,{"LANGUAGE":"eng","TITLE":"Outdated software in use","OBSERVATION":{"TITLE":"Outdated and potentially vulnerable software exists on several web servers throughout the environment. The exploits related to the identified software versions have a high likelihood of resulting in a denial of service and were therefore not attempted by Deloitte. Note: The observation was made based on the information disclosed on the affected servers' banners. It may be possible for an up-to-date product to be incorrectly reflected on the banner as outdated. In those scenarios, the observation should be disregarded. Furthermore, the listed CVEs for each product are only an example of all existing vulnerabilities.","NOTE":""},"IMPLICATION":"It may be more feasible for a malicious individual to compromise outdated and discontinued services. Some of the vulnerabilities for the outdated software are rated as <low/medium/high> risk and the related exploit may be publicly available on the Internet. Exploits could be used to generate DOS attacks, perform privilege escalation or gain unauthorized access to sensitive information among other consequences.\n<PATCHING: If patch installation is not scheduled regularly enough, vulnerable systems may exist that pose a security risk to the rest of the network. Additionally, if systems are not included as part of the patch management automatic process (e.g. WSUS tool), critical servers may not be updated in a timely manner. This issue is especially critical when outdated systems are exposed to the Internet, such as those placed in the DMZ. Finally, without the ability to test patches on application servers, there is a risk that patch installation may cause issues in the production environment.>","RECOMMENDATION":{"TITLE":"Management should consider upgrading the identified software to the latest recommended version. Furthermore, as a good practice, management should consider regularly monitoring for the release of updates for all applications in use within the environment, and ensure their installation in a timely fashion. Monitoring for the release of patches and service packs for all operating systems in use is also advised.","URLS":["http://capec.mitre.org/data/definitions/310.html"]},"SEVERITY":"HIGH"}
,{"LANGUAGE":"eng","TITLE":"Access to FTP server with default credentials","OBSERVATION":{"TITLE":"The affected system is running an FTP server which allows access with the following default credentials:","NOTE":""},"IMPLICATION":"FTP servers are often used to exchange files between different users. An unauthenticated malicious individual may potentially gain access to the service using known default credentials, thus being able to access sensitive data on the server. Even if no sensitive data is currently accessible, it is possible that it may be inadvertently exposed in the future. Furthermore, if not required for business purposes, unnecessary services consume resources that may otherwise be used for illegitimate purposes.","RECOMMENDATION":{"TITLE":"Management should consider reviewing if FTP access is required for business purposes, and if required, consider changing the current credential values defined on the service, so as to not match default values. Furthermore, management should consider disallowing anonymous connections and replacing FTP for a secure version, such as SFTP, or for modern FTP server builds, this may be done by enabling the explicit and/or implicit FTPS mode, in which encrypted communication is enforced. Otherwise, management should consider turning off this feature, as unused services may become vulnerable at a future time which may expose the system to exploits.","URLS":["http://capec.mitre.org/data/definitions/70.html"]},"SEVERITY":"MEDIUM"}
,{"LANGUAGE":"eng","TITLE":"Plaintext communication services","OBSERVATION":{"TITLE":"The following services present security risks because they do not provide encryption mechanisms. The identified services are: <FTP, TELNET, SNMP v1 and/or SNMP v2, rLogin, HTTP>\n<IF THE SNMP COMMUNITY IS UNKNOWN>Note: The SNMP version could not be identified. If SNMP Version 1 and SNMP version 2 are disabled, this observation might be disregarded. Please not that only SNMP V3 does not send data in plaintext.\n<ONLY HTTP:> The website allows sensitive information, such as application credentials, to be transmitted over an unencrypted (i.e. non-TLS) HTTP channel, which transmits data in plaintext. <FORCED HTTP:> Furthermore, changing the URL from HTTPS to HTTP on the authentication handler for the following link, allows the transmission of credentials over the HTTP protocol:","NOTE":""},"IMPLICATION":"Encryption prevents an eavesdropper with access to the communication layer from observing the original content of the traffic. Since the affected <hosts/applications> do not enforce encryption, content may be transmitted in plaintext. This may allow a malicious individual with access to the communication channel to \n<SI EXTERNO: intercept sensitive information, steal credentials or compromise the affected services by performing external network attacks.>\n<SI INTERNO: generate internal network level threats to compromise the affected services, such as ARP Poison Routing in conjuction with Man-in-the-Middle (MITM) attacks.>","RECOMMENDATION":{"TITLE":"Management should consider evaluating if plaintext communication services are required for business purposes. If unrequired, management should consider disabling them and implementing secure protocols for communication, by replacing current services with their secure counterpart.\n<Telnet and rlogin may be replaced with SSH>.\n<If SNMP v1/v2: Management should consider evaluating if the current version of the SNMP service is required for business purposes. If not required, management should consider removing this service. If required, management should consider evaluating if SNMP V3 is natively supported on the resource, as a secure counterpart. If not supported, consider restricting access to this service only to the monitoring devices on the network.>\n<IF FTP ADD THIS:> FTP may be replaced with SFTP, or for modern FTP server builds, this may be done by enabling the explicit and/or implicit FTPS mode, in which encrypted communication is enforced, preventing a malicious individual from intercepting the transmitted credentials.\n<IF HTTP ADD THIS:> For HTTP, management should consider reviewing the web server configuration to ensure login pages and any other pages which submit or display sensitive information are only accessible via secure channels (e.g. HTTPS protocol). Furthermore, management should consider reviewing their configuration standards for Internet-facing web applications to determine the requirements surrounding plaintext communication. Industry guidelines suggest that sensitive information traversing the Internet be protected by the HTTPS protocol. Web servers should be configured to enforce at least 128 bit encryption over a TLS connection. Additionally, related SSL / TLS certificates should be bound to a specific hostname, valid and issued by a trusted authority to prevent man in the middle attacks and the “secure” attribute should be implemented to protect session cookies transmission. Furthermore, management should consider requesting users to change their current passwords as account credentials may already have been compromised.","URLS":["http://cwe.mitre.org/data/definitions/319.html","http://cwe.mitre.org/data/definitions/523.html"]},"SEVERITY":"MEDIUM"}
,{"LANGUAGE":"spa","TITLE":"Comunicación no cifrada","OBSERVATION":{"TITLE":"Se ha observado la existencia de servicios que presentan riesgos de seguridad debido a que no utilizan un canal de comunicación cifrado. Los servicios identificados son: <FTP, TELNET, SNMPv1, rLogin, rsh, HTTP>\n<SI SOLO SE IDENTIFICO HTTP>Se ha observado que el servidor permite el envío de información sensible, como credenciales de aplicación, sobre un canal no cifrado (es decir, sin la utilización de SSL/TLS), exponiendo las credenciales a ser interceptadas y/o robadas. <EN CASO DE FORZAR EL HTTP>Se ha observado que, si bien el servidor Web soporta la utilización de un canal cifrado (HTTPS), éste no es forzado al ingresar a la aplicación.","NOTE":""},"IMPLICATION":"El uso de canales de comunicación cifrados impide que un individuo malicioso con acceso al medio de comunicación pueda observar el contenido original de la información transmitida. Puesto que los <dispositivos/aplicaciones> afectadas no fuerzan la utilización de cifrado, la información se transmite en texto plano, permitiéndole a un individuo malicioso con acceso al medio\n<SI EXTERNO>interceptar información sensible, robar credenciales o comprometer los servicios afectados realizando ataques de red externos.\n<SI INTERNO>generar ataques de red internos para comprometer los servicios afectados, tales como envenenamiento \"ARP poisoning\" en conjunto con técnicas del tipo \"Main-in-The-Middle\" (MiTM).","RECOMMENDATION":{"TITLE":"Se recomienda analizar si los servicios de comunicación no cifrados son requeridos por el negocio. Si no son requeridos, se recomienda deshabilitarlos y reemplazarlos por las versiones seguras de los protocolos afectados.\n<SI TELNET/RLOGIN>Telnet y rlogin podrían ser reemplazados por SSH.\n<SI SNMPv1>SNMPv1 podría ser reemplazado por SNMPv3.\n<SI FTP>FTP podría ser reemplazado por SFTP.\n<SI HTTP>En el caso de HTTP, se recomienda analizar y modificar la configuración de los servicios web de manera tal que las páginas que transmiten credenciales de usuario y/o cualquier otra información sensible sean únicamente accesibles a través de canales seguros (tal como SSL/TLS). Además, SSL/TLS debe ser configurado de manera tal de forzar un nivel de cifrado de 128 bits o superior. También, se debe asegurar que los certificados SSL utilizados tengan el nombre de host adecuado, no estén expirados, y sean emitidos por una autoridad confiable (CA) para prevenir ataques del tipo Man-in-The-Middle (MiTM). Además, las cookies de sesión utilizadas por la aplicación web deberán ser configuradas utilizando el atributo \"secure\". Finalmente, se recomienda considerar la posibilidad de requerir a los usuarios de la aplicación que modifiquen las contraseñas utilizadas, puesto que las mismas podrían haber sido comprometidas.","URLS":["http://cwe.mitre.org/data/definitions/319.html","http://cwe.mitre.org/data/definitions/523.html"]},"SEVERITY":"MEDIO"}
,{"LANGUAGE":"spa","TITLE":"Enumeración de nombres cortos de archivos y directorios de Microsoft","OBSERVATION":{"TITLE":"La aplicación es susceptible a la enumeración de nombres cortos de archivos y directorios. Cuando un nuevo archivo es creado en un ambiente Windows, se crea también un nombre corto compatible con el formato 8.3 de MS-DOS para dicho archivo. Este nombre corto permite a programas basados en MS-DOS o Windows 16 bits acceder a archivos con nombres largos. En particular, se ha detectado que es posible enumerar nombres cortos de archivos y carpetas en el recurso afectado.\nLa URL afectada es:\nLos directorios afectados son:\n","NOTE":""},"IMPLICATION":"Un individuo malicioso podría aprovechar esta vulnerabilidad para intentar enumerar nombres cortos de directorios y archivos válidos alojados en el servidor que potencialmente pudieran contener información sensible, para luego ejecutar también ataques específicos con el fin de obtener el nombre completo (nombre largo). Esto podría permitir al individuo malicioso ganar acceso no autorizado a los archivos afectados, si los mismos no se encuentran protegidos por un esquema de control acceso adecuado.","RECOMMENDATION":{"TITLE":"Se recomienda deshabilitar la creación de nombres cortos en caso de que no fuera requerida por necesidades del negocio. Como medida complementaria, se debería verificar que las respuestas a errores emitidas tanto por el servidor web IIS como por el framework .NET estén controladas.","URLS":["https://technet.microsoft.com/en-us/library/cc959352.aspx","http://soroush.secproject.com/downloadable/microsoft_iis_tilde_character_vulnerability_feature.pdf"]},"SEVERITY":"MEDIO/ALTO"}
,{"LANGUAGE":"eng","TITLE":"Default credentials in use","OBSERVATION":{"TITLE":"Default credentials were identified to be in use within the <AFFECTED SYSTEM NAME: DB2 Windows/SQL Server/Oracle database/etc..>. Default credentials include the username and password that is automatically assigned during the installation of the software. In particular, the following credentials were leveraged for access:","NOTE":""},"IMPLICATION":"If default credentials are in use, it may be more feasible for a malicious individual to compromise the affected account. Default credentials are usually one of the first targets in an attack, after <an administrative console/ SQL console> is identified, as these credentials are usually of public knowledge. In particular, the aforementioned credentials may be leveraged in order to retrieve potential sensitive information and / or perform unauthorized activity.\n<IF DB2: In addition, if the DB2 Windows account has administrator rights on the system, the malicious individual would obtain local administrative privileges.>\n<IF INTERNAL: Furthermore, obtaining access to a local account may be leveraged as a stepping stone to attempt to perform privilege escalation in order to compromise other systems within the network.>\n<Administrative access to printers/switches may allow a malicious individual to retrieve core business sensitive information. In addition administrative access on switches may be used to launch targeted attacks on the network or abused to perform network changes and/or disrupt network services.>","RECOMMENDATION":{"TITLE":"Management should consider reviewing if it is feasible to modify the currently configured default credentials on the affected <administrative consoles / whatever>. If feasible, the aforementioned password should be changed, ensuring that the new password complies with <CLIENT>'s password policy. Furthermore, management should consider establishing a password expiration policy and reviewing their corporate password policy in order to ensure that passwords are required to be changed regularly. In addition, management should consider performing routine password auditing exercises to identify existing accounts that do not meet <CLIENT>'s password policies.\n<SI INTERNO: Furthermore, management should consider reviewing the requirement for <administrative consoles and components> to be accessible from the internal network. If required, management should consider using two-factor authentication on critical systems and not allowing unauthenticated access to sensitive management areas.>\n<SI EXTERNO: Management should consider preventing remote and anonymous access to the administrative components. If this type of access is required for business purposes, management should consider ensuring that only authorized IPs are allowed and authentication is required.))>","URLS":["http://capec.mitre.org/data/definitions/70.html"]},"SEVERITY":"HIGH"}
,{"LANGUAGE":"spa","TITLE":"Vulnerabilidades de versiones web encontradas","OBSERVATION":{"TITLE":"<TO DEFINE>","NOTE":""},"IMPLICATION":"<TO DEFINE>","RECOMMENDATION":{"TITLE":"<TO DEFINE>","URLS":[]},"SEVERITY":"<TO DEFINE>"}
,{"LANGUAGE":"spa","TITLE":"Posible inyeccion css","OBSERVATION":{"TITLE":"<TO DEFINE>","NOTE":""},"IMPLICATION":"<TO DEFINE>","RECOMMENDATION":{"TITLE":"<TO DEFINE>","URLS":[]},"SEVERITY":"<TO DEFINE>"}
,{"LANGUAGE":"eng","TITLE":"Anonymous access to FTP server","OBSERVATION":{"TITLE":"The affected systems are running FTP servers which allow anonymous access. As a result, no credentials were necessary to access the FTP file folders.","NOTE":""},"IMPLICATION":"FTP servers are often used to exchange files between different users. An unauthenticated malicious individual may potentially gain access to sensitive data on the server. Even if no sensitive data is currently accessible, it is possible that it may be inadvertently exposed in the future. Furthermore, if not required for business purposes, unnecessary services consume resources that may otherwise be used for illegitimate purposes.","RECOMMENDATION":{"TITLE":"Management should consider reviewing if anonymous FTP access is required for business purposes and, if unrequired, consider turning off this feature. If required, management should consider ensuring that no sensitive information is stored on the affected resource and consider performing periodic reviews, per even if the server is not currently disclosing sensitive information, information leakage may inadvertently occur in the future. <IF NOT SECURE ADD THIS: Furthermore, management should consider replacing FTP for a secure version, such as SFTP, or for modern FTP server builds, this may be done by enabling the explicit and/or implicit FTPS mode, in which encrypted communication is enforced>.","URLS":["http://cwe.mitre.org/data/definitions/287.html"]},"SEVERITY":"MEDIUM"}
,{"LANGUAGE":"eng","TITLE":"Information disclosure within system error messages","OBSERVATION":{"TITLE":"Error conditions on the affected URLs produce error messages which disclose information about applications and/or server infrastructure. <Furthermore, stack traces (a listing of current system state) are generated and displayed to the user.>","NOTE":""},"IMPLICATION":"Information gathering is usually the first step to an attack. If the presented errors disclose information about the applications and/or the server infrastructure, a malicious individual may be able to leverage it in order to generate more accurate and complex attacks.","RECOMMENDATION":{"TITLE":"Management should consider modifying the application server configuration to implement a customized error page with a generic message that does not reveal information related to the supporting infrastructure or application.\n<IF IIS: In IIS (.NET), errors may be handled with the use of web.config, For additional information, please refer to the following link: http://msdn.microsoft.com/en-us/library/aa479319.aspx.> <IF APACHE: In Apache, errors may be handled with the use of .htaccess. For additional information, please refer to the following link: http://httpd.apache.org/docs/2.2/custom-error.html.> <Strategic: Management should consider reviewing their coding standards to ensure that error handling techniques are implemented consistently across all applications within the organization.> <IF Application error: For additional information, please refer to the following link: http://cwe.mitre.org/data/definitions/209.html> <IF Framework error e.g.: IIS, Apache, Joomla, wordpress: For additional information, please refer to the following link: http://cwe.mitre.org/data/definitions/550.html > <IF IT DOESN'T HAVE STACK TRACES OR SENSITIVE INFORMATION: For additional information, please refer to the following link: http://cwe.mitre.org/data/definitions/756.html>","URLS":["http://cwe.mitre.org/data/definitions/756.html"]},"SEVERITY":"LOW"}
,{"LANGUAGE":"spa","TITLE":"Librerias 3rd party desactualizadas en uso","OBSERVATION":{"TITLE":"Se ha observado la presencia de librerías que se encuentran desactualizadas. Las librerías observadas, junto con las vulnerabilidades identificadas se detallan a continuación:\n<TABLA CON Librería afectada, Versión Actual, Última versión disponible, CVE>.","NOTE":"<EJEMPLO PARA JQUERY> NOTA: La observación sobre la versión de la librería JQuery fue realizada en base a la información obtenida al acceder a las URL afectadas indicadas anteriormente. Los CVEs listados son sólo una referencia de las vulnerabilidades existentes."},"IMPLICATION":"Un individuo malicioso podría comprometer con mayor facilidad las librerías afectadas, ya que las versiones observadas poseen vulnerabilidades y/o debilidades de seguridad previamente reportadas. Las vulnerabilidades mencionadas son de conocimiento público y los detalles de las mismas se encuentran disponibles. En consecuencia, un individuo malicioso podría intentar explotarlas para comprometer a los usuarios de la aplicación.","RECOMMENDATION":{"TITLE":"Recomendacion tactica:\nSe recomienda analizar la posibilidad de actualizar la librería afectada a la última versión disponible.\nRecomendación estrategica:\nAdicionalmente se recomienda realizar el monitoreo regular de las actualizaciones de las librerías en uso para todas las aplicaciones y asegurarse de instalarlas en un tiempo prudencial.","URLS":["https://capec.mitre.org/data/definitions/310.html"]},"SEVERITY":"MEDIO"}
,{"LANGUAGE":"spa","TITLE":"Permisos de escritura en servidor FTP en forma anónima","OBSERVATION":{"TITLE":"Se ha observado que el servidor FTP afectado permiten el acceso anónimo con permisos de \"Lectura\", \"Modificación\" y \"Escritura\".","NOTE":""},"IMPLICATION":"Debido a la situación planteada, un usuario con acceso a la red interna podría acceder al servicio FTP sin contar con un usuario y una contraseña válida (Acceso anónimo) y generar distintos ataques como ser:\nLectura o eliminación de información de negocio;\nDenegación de servicio a través de la escritura masiva de archivos hasta llenar el disco rígido del servidor.","RECOMMENDATION":{"TITLE":"Se recomienda restringir el acceso anónimo al servicio FTP mediante la utilización de usuarios y grupos con contraseñas.\nAdicionalmente se recomienda utilizar la variante SFTP de dicho servicio, la cual permite cifrar el canal de comunicaciones.","URLS":[]},"SEVERITY":"ALTO"}
,{"LANGUAGE":"spa","TITLE":"Inadecuado manejo de errores","OBSERVATION":{"TITLE":"Se ha observado la presencia de distintos mensajes de error presentados a los usuarios, que revelan información sensible acerca de la infraestructura de los servicios afectados. Algunas condiciones de error en las aplicaciones producen mensajes que generan stack traces (listado de excepciones de memoria), pudiendo revelar información sensible acerca de las funciones e infraestructura de los servicios afectados.","NOTE":""},"IMPLICATION":"Los errores que presentan las aplicaciones afectadas, podrían permitir a un potencial usuario malintencionado, identificar información adicional sobre la infraestructura (tipo de servidor web utilizado, versión, etc.), la cual pueda ser utilizada para generar ataques de mayor precisión, complejidad e impacto.","RECOMMENDATION":{"TITLE":"Se recomienda analizar la posibilidad de modificar la configuración de los servidores web para que los mismos muestren al usuario pantallas de errores generales, personalizados por <CLIENTE>, que no revelen información detallada del error y/o de la infraestructura que soporta el sitio web.","URLS":[]},"SEVERITY":"BAJO"}
,{"LANGUAGE":"spa","TITLE":"Se encontro una vulnerabilidad de CORS","OBSERVATION":{"TITLE":"<TO DEFINE>","NOTE":""},"IMPLICATION":"<TO DEFINE>","RECOMMENDATION":{"TITLE":"<TO DEFINE>","URLS":[]},"SEVERITY":"<TO DEFINE>"}
,{"LANGUAGE":"eng","TITLE":"Insecure HTTP Response Header Configuration (Not found)","OBSERVATION":{"TITLE":"During inspection of the HTTP headers returned by the application, the following series of weaknesses and/or missing adherence to best-practice was observed:\nClickjacking can be used to overlay the application with a layer, which can capture data typed into input fields or to invisibly overlay the application on top of an external site to trick an authenticated user into performing actions inside the application while browsing the external site. We noticed that the system does not set the anti-clickjacking header. \nThe server does not restrict the origin domain using the Cross-Origin Resource Sharing (CORS) header, because the header is not properly configured (e.g. using a ‘wildcard’). This means that any origin domain is permitted to access application resources Furthermorethe server has the “Access-Control-Allow-Credentials: true” flag set. This option will cause the cross-site HTTP request to include HTTP cookies and HTTP authentication information.\nModern browsers have support for the HTTP Strict Transport Security (HSTS) header, which forces the use of SSL/TLS for subsequent visits to the website. This allows mitigation of certain Man-in-the-Middle attacks, for example when a user accesses the HTTP version of a website over an untrusted network. We noticed that the system does not set the HTTP Strict Transport Security header.\nModern browsers and proxy servers cache content to reduce latency and network traffic. The cached content could contain sensitive information. The cache control headers prevent caching of sensitive content in the browser and on proxies. This means that the browser should NEVER cache a sensitive page, it should always retrieve a fresh copy of the page. We noticed that the system does not set the Cache-Control and Pragma: no-cache header.\nModern browsers have support for the Content Security Policy (CSP) header, which allows the web server to define policies for browsers on how to deal with potentially dangerous content, such as inline scripts embedded in a web page or scripts from non-whitelisted domains. CSP also covers stylesheets (CSS). The proper use of the CSP helps to mitigate the risk of so-called Cross-site Scripting attacks (XSS). We noticed the system does not set the Content Security Policy header.\nThe X-XSS-Protection response header is a feature of Internet Explorer, Chrome and Safari to prevent some reflected Cross-site Scripting (XSS) attacks. Although, strong Content-Security-Policy headers are used in modern browsers to prevent XSS attacks, the X-XSS-Protection header can still provide protection for users of older web browsers that do not yet support CSP.","NOTE":""},"IMPLICATION":"Without the anti-clickjacking header, it is possible for an attacker to overlay the site with a transparent layer and capture data input or keystrokes from the user. The attacker would need to find a Cross-site Scripting issue or trick the user into visiting the page through a crafted link/website before this can be misused.\nBy missing the CORS header it is possible for an attacker to include components, images, pages from the application into other websites. This could be used by the attacker to craft a site with scripts which retrieves data from the application and submits it to the attacker.\nWhen no HSTS header is present and the site is also available over unencrypted HTTP, attackers can use special tooling to keep victims who access the site over HTTP on an HTTP connection, despite attempts of the application to redirect the user to HTTPS (known as ‘ssl stripping’). An attacker would need to be on a dedicated network to be able to perform such a Man-in-the-Middle attack.\nWithout a CSP and X-XSS-Protection header, it is possible for an attacker to abuse other vulnerabilities, such as XSS, to load additional resources such as scripts or exploits into victims browsers in order to increase the attack vectors they have at their disposal.","RECOMMENDATION":{"TITLE":"It is recommended to improve the HTTP header configuration by:\nImplementing anti-clickjacking measures, such as adding the X-Frame-Options header.\nUsing a “whitelist” approach for permitting origin domains to prevent CORS. Normally only the domain should be allowed.\nEnable the HTTP Strict Transport Security header to enforce usage of SSL/TLS in modern browsers and to improve protection against downgrade attacks and cookie hijacking.\nEnable cache control headers (cache-control: private, max-age0, no-cache) and the pragma header (pragma: no-cache) for older browsers.\nDefine a whitelist in the Content Security Policy header to enforce security policies in modern browsers on potentially malicious use of scripts and stylesheets.","URLS":["<If Clickjacking> https://www.owasp.org/index.php/Clickjacking_Defense_Cheat_Sheet.","<If CORS> https://www.owasp.org/index.php/CORS_OriginHeaderScrutiny","<If HSTS>https://www.owasp.org/index.php/HTTP_Strict_Transport_Security.","<IF CSP>https://www.owasp.org/index.php/Content_Security_Policy.","<If Cache-Control>https://www.owasp.org/index.php/OWASP_Application_Security_FAQ#Browser_Cache."]},"SEVERITY":"HIGH"}
,{"LANGUAGE":"spa","TITLE":"Acceso a FTP con credenciales por defecto","OBSERVATION":{"TITLE":"El sistema corre un servicio FTP que puede ser accedido con las siguientes credenciales:","NOTE":""},"IMPLICATION":"Los servidores FTP a menudo se usan para intercambiar archivos entre diferentes usuarios. Una persona malintencionada no autenticada puede obtener acceso al servicio utilizando credenciales predeterminadas conocidas, pudiendo así acceder a datos confidenciales en el servidor. Incluso si actualmente no se puede acceder a datos confidenciales, es posible que se expongan inadvertidamente en el futuro. Además, si no se requiere para fines comerciales, los servicios innecesarios consumen recursos que de otro modo podrían usarse para fines ilegítimos.","RECOMMENDATION":{"TITLE":"La gerencia debería considerar revisar si se requiere acceso FTP para fines comerciales y, si es necesario, considerar cambiar los valores de credenciales actuales definidos en el servicio, para no coincidir con los valores predeterminados. Además, la administración debería considerar no permitir conexiones anónimas y reemplazar FTP por una versión segura, como SFTP, o para compilaciones de servidores FTP modernos, esto se puede hacer habilitando el modo FTPS explícito y / o implícito, en el que se aplica la comunicación cifrada. De lo contrario, la administración debería considerar desactivar esta función, ya que los servicios no utilizados pueden volverse vulnerables en el futuro, lo que puede exponer el sistema a ataques.","URLS":["http://capec.mitre.org/data/definitions/70.html"]},"SEVERITY":"MEDIUM"}
,{"LANGUAGE":"eng","TITLE":"Weak transport layer security (TLS) configuration","OBSERVATION":{"TITLE":"<TO DEFINE>","NOTE":""},"IMPLICATION":"<TO DEFINE>","RECOMMENDATION":{"TITLE":"<TO DEFINE>","URLS":[]},"SEVERITY":"<TO DEFINE>"}
,{"LANGUAGE":"spa","TITLE":"Inadecuada configuración de seguridad de capa de transporte (TLS)","OBSERVATION":{"TITLE":"<TO DEFINE>","NOTE":""},"IMPLICATION":"<TO DEFINE>","RECOMMENDATION":{"TITLE":"<TO DEFINE>","URLS":[]},"SEVERITY":"<TO DEFINE>"}
,{"LANGUAGE":"eng","TITLE":"Untrusted SSL / TLS certificate","OBSERVATION":{"TITLE":"<TO DEFINE>","NOTE":""},"IMPLICATION":"<TO DEFINE>","RECOMMENDATION":{"TITLE":"<TO DEFINE>","URLS":[]},"SEVERITY":"<TO DEFINE>"}
,{"LANGUAGE":"spa","TITLE":"Certificado SSL invalido","OBSERVATION":{"TITLE":"<TO DEFINE>","NOTE":""},"IMPLICATION":"<TO DEFINE>","RECOMMENDATION":{"TITLE":"<TO DEFINE>","URLS":[]},"SEVERITY":"<TO DEFINE>"}
]